# DeleteWorksetSettings Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DeleteWorksetSettings Constructor
DeleteWorksetSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DeleteWorksetSettings()()()() | Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option. |
| DeleteWorksetSettings(DeleteWorksetOption, WorksetId) | Constructs a DeleteWorksetSettings object. |

# See Also
DeleteWorksetSettings Class
DeleteWorksetSettings Members
Autodesk.Revit.DB Namespace